In [72]:
# Load packages and libraries

import pandas as pd
import numpy as np
import quandl
import requests
from dotenv import load_dotenv
import os
import alpaca_trade_api as tradeapi
import nasdaqdatalink
import yfinance as yf
import matplotlib.pyplot as plt
import random
from datetime import date
import warnings

### Weapons Manufacturers' Stock Data

#### The Gulf War

In [52]:
# Get weapons stock data for Gulf War from Yahoo Finance

tickerStrings = ["LMT", "BA", "RTX", "NOC"]
df_list = list()
for ticker in tickerStrings:
    data = yf.download(ticker, group_by="Ticker", start="1990-02-01", end="1991-02-28")
    data["ticker"] = ticker
    df_list.append(data)

# Combine all dataframes into a single dataframe

weapons_gulf_df = pd.concat(df_list)

[*********************100%***********************]  1 of 1 completed
[*********************100%***********************]  1 of 1 completed
[*********************100%***********************]  1 of 1 completed
[*********************100%***********************]  1 of 1 completed

In [53]:
# Investigate dataframe

weapons_gulf_df.head()

,Open,High,Low,Close,Adj Close,Volume,ticker
Date,,,,,,,
1990-02-01,11.963190,11.963190,11.694785,11.733129,4.849932,163000,LMT
1990-02-02,11.656442,11.924847,11.656442,11.924847,4.929179,399676,LMT
1990-02-05,12.039877,12.078221,11.694785,11.694785,4.834082,421192,LMT
1990-02-06,11.694785,11.694785,11.273006,11.311350,4.675589,262430,LMT
1990-02-07,11.273006,11.388037,11.081288,11.273006,4.659739,567892,LMT

In [54]:
# Convert dataframe to csv in Resources folder

# weapons_gulf_df.to_csv("weapons_gulf.csv")

In [55]:
# Clean up dataframe to include only closing prices

weapons_gulf_df = weapons_gulf_df.drop(columns=["Open", "High", "Low", "Adj Close", "Volume"])
weapons_gulf_df = weapons_gulf_df.pivot(columns = "ticker", values = "Close")

# Investigate dataframe

weapons_gulf_df.head()

ticker             BA        LMT       NOC       RTX
Date
1990-02-01  20.416668  11.733129  8.075031  3.952958
1990-02-02  20.750000  11.924847  7.962094  3.933291
1990-02-05  21.041668  11.694785  7.905625  3.992291
1990-02-06  21.166668  11.311350  7.679750  3.923458
1990-02-07  21.166668  11.273006  7.905625  3.923458

#### The War in Iraq

In [56]:
# Get weapon stock data for the War in Iraq from Yahoo Finance

tickerStrings = ["LMT", "BA", "RTX", "NOC"]
df_list = list()
for ticker in tickerStrings:
    data = yf.download(ticker, group_by="Ticker", start="2003-03-01", end="2011-12-31")
    data["ticker"] = ticker
    df_list.append(data)

# Combine all dataframes into a single dataframe

weapons_iraq_df = pd.concat(df_list)

[*********************100%***********************]  1 of 1 completed
[*********************100%***********************]  1 of 1 completed
[*********************100%***********************]  1 of 1 completed
[*********************100%***********************]  1 of 1 completed

In [57]:
# Investigate dataframe

weapons_iraq_df.head()

,Open,High,Low,Close,Adj Close,Volume,ticker
Date,,,,,,,
2003-03-03,46.389999,46.619999,45.700001,45.779999,27.045065,2123500,LMT
2003-03-04,45.790001,46.450001,44.910000,46.080002,27.222284,2535100,LMT
2003-03-05,44.209999,45.900002,42.560001,45.080002,26.631527,4945000,LMT
2003-03-06,45.090000,45.200001,44.090000,44.570000,26.330238,5266300,LMT
2003-03-07,44.570000,44.570000,43.000000,43.560001,25.733566,5048900,LMT

In [24]:
# Convert dataframe to csv in Resources folder

# weapons_iraq_df.to_csv("weapons_iraq.csv")

In [58]:
# Clean up dataframe to include only closing prices

weapons_iraq_df = weapons_iraq_df.drop(columns=["Open", "High", "Low", "Adj Close", "Volume"])
weapons_iraq_df = weapons_iraq_df.pivot(columns = "ticker", values = "Close")

# Investigate dataframe

weapons_iraq_df.head()

ticker             BA        LMT        NOC        RTX
Date
2003-03-03  27.110001  45.779999  39.130585  18.187538
2003-03-04  27.450001  46.080002  39.419704  17.929516
2003-03-05  26.740000  45.080002  37.834064  17.866583
2003-03-06  26.160000  44.570000  37.974106  17.709251
2003-03-07  25.840000  43.560001  37.373280  17.973568

#### The Russian Invasion of Ukraine

In [59]:
# Get weapon stock data for the Russian Invasion of Ukraine from Yahoo Finance

tickerStrings = ["LMT", "BA", "RTX", "NOC"]
df_list = list()
for ticker in tickerStrings:
    data = yf.download(ticker, group_by="Ticker", start="2021-08-24", end="2022-06-30")
    data["ticker"] = ticker
    df_list.append(data)

# Combine all dataframes into a single dataframe

weapons_rusua_df = pd.concat(df_list)

[*********************100%***********************]  1 of 1 completed
[*********************100%***********************]  1 of 1 completed
[*********************100%***********************]  1 of 1 completed
[*********************100%***********************]  1 of 1 completed

In [60]:
# Investigate dataframe

weapons_rusua_df.head()

,Open,High,Low,Close,Adj Close,Volume,ticker
Date,,,,,,,
2021-08-24,358.970001,360.489990,357.920013,359.000000,348.898315,822600,LMT
2021-08-25,359.690002,360.649994,357.989990,358.750000,348.655334,953500,LMT
2021-08-26,359.100006,361.980011,357.239990,361.619995,351.444611,1172400,LMT
2021-08-27,363.290009,364.329987,361.179993,361.989990,351.804199,1203900,LMT
2021-08-30,362.250000,363.959991,361.750000,362.049988,351.862488,986000,LMT

In [12]:
# Convert dataframe to csv in Resources folder

# weapons_rusua_df.to_csv("weapons_rusua.csv")

In [61]:
# Clean up dataframe to include only closing prices

weapons_rusua_df = weapons_rusua_df.drop(columns=["Open", "High", "Low", "Adj Close", "Volume"])
weapons_rusua_df = weapons_rusua_df.pivot(columns = "ticker", values = "Close")

# Investigate dataframe

weapons_rusua_df.head()

ticker              BA         LMT         NOC        RTX
Date
2021-08-24  221.429993  359.000000  362.769989  85.430000
2021-08-25  221.029999  358.750000  362.660004  85.730003
2021-08-26  216.500000  361.619995  366.760010  84.760002
2021-08-27  221.750000  361.989990  364.839996  85.400002
2021-08-30  217.660004  362.049988  367.619995  84.800003

### Gas Companies' Stock Data

#### The Gulf War

In [62]:
# Get gas stock data for the Gulf War from Yahoo Finance

tickerStrings = ["XOM", "BP", "COP", "CVX"]
df_list = list()
for ticker in tickerStrings:
    data = yf.download(ticker, group_by="Ticker", start="1990-02-01", end="1990-12-31")
    data["ticker"] = ticker
    df_list.append(data)

# Combine all dataframes into a single dataframe

gas_gulf_df = pd.concat(df_list)

[*********************100%***********************]  1 of 1 completed
[*********************100%***********************]  1 of 1 completed
[*********************100%***********************]  1 of 1 completed
[*********************100%***********************]  1 of 1 completed

In [63]:
# Investigate dataframe

gas_gulf_df.head()

                Open      High       Low     Close  Adj Close   Volume ticker
Date
1990-02-01  11.81250  11.84375  11.75000  11.75000   3.956184  2903200    XOM
1990-02-02  11.78125  11.96875  11.75000  11.96875   4.029834  4246400    XOM
1990-02-05  12.00000  12.09375  11.96875  12.00000   4.040357  5880400    XOM
1990-02-06  11.84375  11.87500  11.56250  11.81250   4.027570  4739600    XOM
1990-02-07  11.75000  12.00000  11.68750  12.00000   4.091500  4108800    XOM

In [30]:
# Convert dataframe to csv in Resources folder

# gas_gulf_df.to_csv("gas_gulf.csv")

In [64]:
# Clean up dataframe to include only closing prices

gas_gulf_df = gas_gulf_df.drop(columns=["Open", "High", "Low", "Adj Close", "Volume"])
gas_gulf_df = gas_gulf_df.pivot(columns = "ticker", values = "Close")

# Investigate dataframe

gas_gulf_df.head()

ticker            BP       COP       CVX       XOM
Date
1990-02-01  17.46875  9.767181  16.65625  11.75000
1990-02-02  17.50000  9.767181  16.78125  11.96875
1990-02-05  17.56250  9.767181  16.87500  12.00000
1990-02-06  17.50000  9.862470  16.78125  11.81250
1990-02-07  17.40625  9.957760  16.96875  12.00000

#### The War in Iraq

In [65]:
# Get gas stock data for the Iraq War from Yahoo Finance

tickerStrings = ["XOM", "BP", "COP", "CVX"]
df_list = list()
for ticker in tickerStrings:
    data = yf.download(ticker, group_by="Ticker", start="2003-03-01", end="2011-12-31")
    data["ticker"] = ticker
    df_list.append(data)

# Combine all dataframes into a single dataframe

gas_iraq_df = pd.concat(df_list)

[*********************100%***********************]  1 of 1 completed
[*********************100%***********************]  1 of 1 completed
[*********************100%***********************]  1 of 1 completed
[*********************100%***********************]  1 of 1 completed

In [66]:
# Investigate dataframe

gas_iraq_df.head()

,Open,High,Low,Close,Adj Close,Volume,ticker
Date,,,,,,,
2003-03-03,34.389999,34.730000,34.200001,34.459999,18.463022,12094000,XOM
2003-03-04,34.700001,34.740002,34.169998,34.230000,18.339792,10453100,XOM
2003-03-05,34.230000,34.919998,34.220001,34.919998,18.709488,12192000,XOM
2003-03-06,34.750000,34.860001,34.410000,34.560001,18.516600,12140800,XOM
2003-03-07,34.099998,34.880001,34.080002,34.790001,18.639837,13199300,XOM

In [35]:
# Convert dataframe to csv in Resources folder

# gas_iraq_df.to_csv("gas_iraq.csv")

In [67]:
# Clean up dataframe to include only closing prices

gas_iraq_df = gas_iraq_df.drop(columns=["Open", "High", "Low", "Adj Close", "Volume"])
gas_iraq_df = gas_iraq_df.pivot(columns = "ticker", values = "Close")

# Investigate dataframe

gas_iraq_df.head()

ticker             BP        COP        CVX        XOM
Date
2003-03-03  39.279999  19.724941  32.270000  34.459999
2003-03-04  39.340000  19.629650  32.325001  34.230000
2003-03-05  39.270000  19.583912  32.974998  34.919998
2003-03-06  39.099998  19.366652  32.689999  34.560001
2003-03-07  38.860001  19.667767  32.630001  34.790001

#### The Russian Invasion of Ukraine

In [68]:
# Get gas stock data for the Russian Invasion of Ukraine from Yahoo Finance

tickerStrings = ["XOM", "BP", "COP", "CVX"]
df_list = list()
for ticker in tickerStrings:
    data = yf.download(ticker, group_by="Ticker", start="2021-08-24", end="2022-06-30")
    data["ticker"] = ticker
    df_list.append(data)

# Combine all dataframes into a single dataframe

gas_rusua_df = pd.concat(df_list)

[*********************100%***********************]  1 of 1 completed
[*********************100%***********************]  1 of 1 completed
[*********************100%***********************]  1 of 1 completed
[*********************100%***********************]  1 of 1 completed

In [69]:
# Investigate dataframe

gas_rusua_df.head()

,Open,High,Low,Close,Adj Close,Volume,ticker
Date,,,,,,,
2021-08-24,55.290001,55.849998,55.009998,55.360001,53.479130,17915600,XOM
2021-08-25,55.240002,55.770000,54.869999,55.459999,53.575729,13270300,XOM
2021-08-26,55.200001,55.540001,54.630001,54.709999,52.851212,11842600,XOM
2021-08-27,55.400002,56.209999,55.400002,55.770000,53.875202,15822500,XOM
2021-08-30,56.240002,56.340000,55.119999,55.160000,53.285923,14086100,XOM

In [70]:
# Convert dataframe to csv in Resources folder

# gas_rusua_df.to_csv("gas_rusua.csv")

In [71]:
# Clean up dataframe to include only closing prices

gas_rusua_df = gas_rusua_df.drop(columns=["Open", "High", "Low", "Adj Close", "Volume"])
gas_rusua_df = gas_rusua_df.pivot(columns = "ticker", values = "Close")

# Investigate dataframe 
gas_rusua_df.head()

ticker             BP        COP        CVX        XOM
Date
2021-08-24  24.650000  55.410000  97.839996  55.360001
2021-08-25  24.629999  56.020000  98.510002  55.459999
2021-08-26  24.299999  55.130001  97.220001  54.709999
2021-08-27  24.940001  56.740002  98.639999  55.770000
2021-08-30  24.700001  56.200001  98.389999  55.160000

### Crude Oil Prices Data

In [14]:
# Import crude oil prices from csv in Resources folder

crude_df = pd.read_csv("Resources/Cushing_OK_WTI_Spot_Price_FOB.csv")
crude_df = crude_df.rename(columns={"Cushing OK WTI Spot Price FOB Dollars per Barrel":"WTI in Dollars Per Barrel"})

In [15]:
# Check for null values

crude_df.isnull().sum()

Month                        0
WTI in Dollars Per Barrel    0
dtype: int64

In [50]:
# Investigate dataframe

crude_df.head()

            WTI in Dollars Per Barrel
Month
2022-06-01                     114.84
2022-05-01                     109.55
2022-04-01                     101.78
2022-03-01                     108.50
2022-02-01                      91.64

In [17]:
# Change "Month" column to datetime object

crude_df["Month"]=pd.to_datetime(crude_df["Month"])

# Set "Month" as the index

crude_df.set_index("Month", inplace=True)

In [ ]:
# Investigate dataframe

crude_df.head()

#### The Gulf War

In [42]:
# Create dataframe for oil prices during the Gulf War

gulf_oil_df = crude_df.loc["Feb 1990":"Dec 1990"]

# Investigate dataframe

gulf_oil_df.head()

            WTI in Dollars Per Barrel
Month
1990-12-01                      27.28
1990-11-01                      32.33
1990-10-01                      36.04
1990-09-01                      33.51
1990-08-01                      27.31

#### The War in Iraq

In [43]:
# Create dataframe for oil prices during the War in Iraq

iraq_oil_df = crude_df.loc["Mar 2003":"Dec 2011"]

# Investigate dataframe

iraq_oil_df.head()

            WTI in Dollars Per Barrel
Month
2011-12-01                      98.56
2011-11-01                      97.16
2011-10-01                      86.32
2011-09-01                      85.52
2011-08-01                      86.33

#### The Russian Invasion of Ukraine

In [45]:
# Create dataframe for oil prices during the Russian Invasion of Ukraine

rus_ua_oil_df = crude_df.iloc[0:11,:]

# Investigate dataframe

rus_ua_oil_df.head()

            WTI in Dollars Per Barrel
Month
2022-06-01                     114.84
2022-05-01                     109.55
2022-04-01                     101.78
2022-03-01                     108.50
2022-02-01                      91.64

### Housing Prices Data

In [73]:
# Load the .env environment variables

load_dotenv()

True

In [74]:
# Get the environment variables

q_API_KEY = os.getenv("QUANDL_API_KEY")

# Set up the API key

quandl.ApiConfig.api_key = q_API_KEY

#### The Russian Invasion of Ukraine

In [79]:
# Connect to Zillow via Quandl to get U.S. housing prices during the Russian Invasion of Ukraine

zillow_indicators = quandl.get_table("ZILLOW/INDICATORS", paginate=True)

# Investigate dataframe

zillow_indicators

,indicator_id,indicator,category
None,,,
0,ZSFH,ZHVI Single-Family Homes Time Series ($),Home values
1,ZCON,ZHVI Condo/Co-op Time Series ($),Home values
2,ZATT,ZHVI All Homes- Top Tier Time Series ($),Home values
3,ZALL,"ZHVI All Homes (SFR, Condo/Co-op) Time Series ($)",Home values
4,ZABT,ZHVI All Homes- Bottom Tier Time Series ($),Home values
5,Z5BR,ZHVI 5+ Bedroom Time Series ($),Home values
6,Z4BR,ZHVI 4-Bedroom Time Series ($),Home values
7,Z3BR,ZHVI 3-Bedroom Time Series ($),Home values
8,Z2BR,ZHVI 2-Bedroom Time Series ($),Home values
9,Z1BR,ZHVI 1-Bedroom Time Series ($),Home values
10,SSSW,"Median Sale Price (Smooth, SFR only, Weekly View)",Inventory and sales
11,SSSM,"Median Sale Price (Smooth, SFR only, Monthly)",Inventory and sales
12,SSAW,"Median Sale Price (Smooth, All Homes, Weekly V...",Inventory and sales
13,SSAM,"Median Sale Price (Smooth, All Homes, Monthly)",Inventory and sales
14,SRSW,"Median Sale Price (Raw, SFR only, Weekly View)",Inventory and sales
15,SRSM,"Median Sale Price (Raw, SFR only, Monthly)",Inventory and sales
16,SRAW,"Median Sale Price (Raw, All Homes, Weekly View)",Inventory and sales
17,SRAM,"Median Sale Price (Raw, All Homes, Monthly)",Inventory and sales
18,SASW,Median Sale Price (Smooth & Seasonally Adjuste...,Inventory and sales
19,SASM,Median Sale Price (Smooth & Seasonally Adjuste...,Inventory and sales
20,SAAW,Median Sale Price (Smooth & Seasonally Adjuste...,Inventory and sales
21,SAAM,Median Sale Price (Smooth & Seasonally Adjuste...,Inventory and sales
22,RSSA,"ZORI (Smoothed, Seasonally Adjusted): All Home...",Rentals
23,RSNA,ZORI (Smoothed): All Homes Plus Multifamily Ti...,Rentals
24,NSAW,"Median Days to Pending (Smooth, All Homes, Wee...",Inventory and sales
25,NSAM,"Median Days to Pending (Smooth, All Homes, Mon...",Inventory and sales
26,NRAW,"Median Days to Pending (Raw, All Homes, Weekly...",Inventory and sales
27,NRAM,"Median Days to Pending (Raw, All Homes, Monthly)",Inventory and sales
28,MSAW,"Mean Days to Pending (Smooth, All Homes, Weekl...",Inventory and sales
29,MSAM,"Mean Days to Pending (Smooth, All Homes, Monthly)",Inventory and sales
30,MRAW,"Mean Days to Pending (Raw, All Homes, Weekly V...",Inventory and sales
31,MRAM,"Mean Days to Pending (Raw, All Homes, Monthly)",Inventory and sales
32,LSSW,"Median List Price (Smooth, SFR Only, Weekly View)",Inventory and sales
33,LSSM,"Median List Price (Smooth, SFR Only, Monthly)",Inventory and sales
34,LSAW,"Median List Price (Smooth, All Homes, Weekly V...",Inventory and sales
35,LSAM,"Median List Price (Smooth, All Homes, Monthly)",Inventory and sales
36,LRSW,"Median List Price (Raw, SFR Only, Weekly View)",Inventory and sales
37,LRSM,"Median List Price (Raw, SFR Only, Monthly)",Inventory and sales
38,LRAW,"Median List Price (Raw, All Homes, Weekly View)",Inventory and sales
39,LRAM,"Median List Price (Raw, All Homes, Monthly)",Inventory and sales
40,ISSW,"For-Sale Inventory (Smooth, SFR only, Weekly V...",Inventory and sales
41,ISSM,"For-Sale Inventory (Smooth, SFR only, Monthly)",Inventory and sales
42,ISAW,"For-Sale Inventory (Smooth, All Homes, Weekly ...",Inventory and sales
43,ISAM,"For-Sale Inventory (Smooth, All Homes, Monthly)",Inventory and sales
44,IRSW,"For-sale Inventory (Raw, SFR only, Weekly View)",Inventory and sales
45,IRSM,"For-sale Inventory (Raw, SFR only, Monthly)",Inventory and sales
46,IRAW,"For-Sale Inventory (Raw, All Homes, Weekly View)",Inventory and sales
47,IRAM,"For-Sale Inventory (Raw, All Homes, Monthly)",Inventory and sales
48,CSSW,"Share of Listings With a Price Cut (Smooth, SF...",Inventory and sales
49,CSSM,"Share of Listings With a Price Cut (Smooth, SF...",Inventory and sales
50,CSAW,"Share of Listings With a Price Cut (Smooth, Al...",Inventory and sales
51,CSAM,"Share of Listings With a Price Cut (Smooth, Al...",Inventory and sales
52,CRSW,"Share of Listings With a Price Cut (Raw, SFR O...",Inventory and sales
53,CRSM,"Share of Listings With a Price Cut (Raw, SFR O...",Inventory and sales
54,CRAW,"Share of Listings With a Price Cut (Raw, All H...",Inventory and sales
55,CRAM,"Share of Listings With a Price Cut (Raw, All H...",Inventory and sales

In [80]:
# Clean up dataframe to retrieve only "Home values" category

mask = zillow_indicators['category']=='Home values'

home_values_ind = zillow_indicators[mask]

# Investigate dataframe

home_values_ind

## This dataframe describes the indicators present in the data set. We are going to use 
## the ZALL indicator_id (ZHVI All Homes(SFR, Condo/Co-op))

,indicator_id,indicator,category
None,,,
0,ZSFH,ZHVI Single-Family Homes Time Series ($),Home values
1,ZCON,ZHVI Condo/Co-op Time Series ($),Home values
2,ZATT,ZHVI All Homes- Top Tier Time Series ($),Home values
3,ZALL,"ZHVI All Homes (SFR, Condo/Co-op) Time Series ($)",Home values
4,ZABT,ZHVI All Homes- Bottom Tier Time Series ($),Home values
5,Z5BR,ZHVI 5+ Bedroom Time Series ($),Home values
6,Z4BR,ZHVI 4-Bedroom Time Series ($),Home values
7,Z3BR,ZHVI 3-Bedroom Time Series ($),Home values
8,Z2BR,ZHVI 2-Bedroom Time Series ($),Home values
9,Z1BR,ZHVI 1-Bedroom Time Series ($),Home values

In [82]:
# Get the regions of the U.S. available on the Zillow API

zillow_regions = quandl.get_table('ZILLOW/REGIONS', paginate= True)

# Investigate dataframe

zillow_regions

      region_id region_type                                           region
None
0         99999         zip   98847; WA; Wenatchee; Chelan County; Peshastin
1         99998         zip              98846; WA; Okanogan County; Pateros
2         99997         zip  98845; WA; Wenatchee; Douglas County; Palisades
3         99996         zip             98844; WA; Okanogan County; Oroville
4         99995         zip     98843; WA; Wenatchee; Douglas County; Orondo
...         ...         ...                                              ...
79247    100000         zip      98848; WA; Moses Lake; Grant County; Quincy
79248     10000        city                  Bloomington; MD; Garrett County
79249      1000      county                      Echols County; GA; Valdosta
79250       100      county               Bibb County; AL; Birmingham-Hoover
79251        10       state                                     Colorado; CO

[79252 rows x 3 columns]

In [83]:
# All the States in the U.S.

states = ['IA', 'KS', 'UT', 'VA', 'NC', 'NE', 'SD', 'AL', 'ID', 'FM', 'DE', 'AK', 'CT', 'PR', 'NM', 'MS', 'PW', 'CO', 'NJ', 'FL', 'MN', 'VI', 'NV', 'AZ', 'WI', 'ND', 'PA', 'OK', 'KY', 'RI', 'NH', 'MO', 'ME', 'VT', 'GA', 'GU', 'AS', 'NY', 'CA', 'HI', 'IL', 'TN', 'MA', 'OH', 'MD', 'MI', 'WY', 'WA', 'OR', 'MH', 'SC', 'IN', 'LA', 'MP', 'DC', 'MT', 'AR', 'WV', 'TX']

## The "region" column is a list of strings. We will use the "zip" type in the "region_type" column to find the state in which
## the region exists.

In [84]:
# Function to get the states in the "region" column

def state_check(search_field): 
    # Separate the search field data set into a list
    search_field = [elem.strip() for elem in search_field.split(";")]
    
    for elem in search_field:
        if elem in states: 
            return elem

In [87]:
# Create a new "state" field using "zip" in "region_type" column

mask = zillow_regions['region_type']=='zip'
zillow_regions_zip = zillow_regions[mask].copy()

In [88]:
# Create a new "state" column using the state_check function

zillow_regions_zip['state'] = zillow_regions_zip.apply(lambda x: state_check(x['region']), axis =1)

# Investigate dataframe

zillow_regions_zip.head()

,region_id,region_type,region,state
None,,,,
0,99999,zip,98847; WA; Wenatchee; Chelan County; Peshastin,WA
1,99998,zip,98846; WA; Okanogan County; Pateros,WA
2,99997,zip,98845; WA; Wenatchee; Douglas County; Palisades,WA
3,99996,zip,98844; WA; Okanogan County; Oroville,WA
4,99995,zip,98843; WA; Wenatchee; Douglas County; Orondo,WA

#### The following function serves as a loop to get the housing market prices for all the states. Since each state could have several region_ids in excess of 1000, use a random sample of 30 from each state to calculate the average housing prices of each state. This part might take some time and therefore you should give it about 5-10 minutes to complete. The function will print out the iteration number to show its progress. Ends at iteration 58.

In [110]:
for id, state in enumerate(states):
    
    # Get the rows with the current state value
    mask = zillow_regions_zip['state']==state
    
    # Filter the rows out in the dataframe
    zillow_ak = zillow_regions_zip[mask]
    
    # Get the region_ids for that particular state
    region_ids = zillow_ak['region_id'].unique()
    
    # Investigate the progress
    print(id)
    
    # Create a list of the region ids so as to get that with those particular IDs
    ids = list(region_ids)
    
    # Check if ids are > 100 since we are only going to pick a random sample of 100
    if len(ids)>100:
        r_ids = random.sample(ids, 30)
    elif len(ids)==0:
        continue
    else: 
        r_ids = ids
    
    # Get the dataframe containing the housing prices using the ZALL indicator_id from the home_values_ind  dataframe

    df = quandl.get_table('ZILLOW/DATA', indicator_id="ZALL", region_id=r_ids , paginate = True)
    
    # Group the "value" by date and then finding the average
    
    data = df.groupby(['date'])['value'].mean()
    
    # Check if it is the first iteration
    
    if id==0: 
        data_df = pd.DataFrame(data)
        data_df.rename(columns = {'value': state}, inplace = True)
        data_df.reset_index(inplace = True)
    else:
        new_df = pd.DataFrame(data)
        new_df.rename(columns = {'value': state}, inplace = True)
        new_df.reset_index(inplace = True)
        data_df = pd.merge(data_df, new_df, how = 'left')

0
1
2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
19
20
21
22
23
24
25
26
27
28
29
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
48
49
50
51
52
53
54
55
56
57
58

In [111]:
# Investigate dataframe

data_df.head()

,date,IA,KS,UT,VA,NC,NE,SD,AL,ID,...,WA,OR,SC,IN,LA,DC,MT,AR,WV,TX
0,1996-01-31,67760.2,102518.0,156549.500000,217629.25,80859.600000,106345.125,NaN,91151.50,105704.666667,...,153842.500000,125194.466667,62437.833333,87297.5,94206.5,152310.8,NaN,50032.500000,51346.571429,80101.875
1,1996-02-29,67821.6,102717.0,156682.250000,217242.75,81066.300000,106716.250,NaN,91138.00,105864.666667,...,152537.600000,125582.533333,62627.166667,87063.5,94380.0,151765.6,NaN,50077.722222,51392.000000,80321.750
2,1996-03-31,67908.4,102866.0,157244.750000,216877.00,81099.100000,106953.750,NaN,91039.00,105888.000000,...,152740.066667,125871.933333,62898.166667,87052.0,94588.5,151237.8,NaN,50178.222222,51431.571429,80390.875
3,1996-04-30,67982.6,103198.0,158121.000000,215768.50,81323.900000,107585.250,NaN,91109.25,106057.333333,...,153053.200000,126550.000000,63385.166667,86927.5,95126.5,150691.0,NaN,50354.444444,51538.428571,80618.250
4,1996-05-31,68002.6,103564.0,171499.428571,215423.50,79729.272727,108109.125,NaN,91348.50,106134.333333,...,153330.066667,127164.733333,63875.333333,86899.0,95398.5,150246.0,NaN,50566.944444,51590.428571,80726.500

In [112]:
# Get housing prices during the Russian Invasion of Ukraine 

mask = data_df['date']>="2021-08-01"

# Create dataframe

ukr_rus_df = data_df[mask].copy()
ukr_rus_df = ukr_rus_df.round(2)

# Calculate the national average

ukr_rus_df['national_average'] = ukr_rus_df.mean(axis=1).round(2)
ukr_rus_df['national_median'] = ukr_rus_df.median(axis=1).round(2)

# Investigate dataframe

ukr_rus_df.head()

/var/folders/h7/8phf74x52sb11gfklddg5sy40000gn/T/ipykernel_13715/3298357071.py:12: FutureWarning: DataFrame.mean and DataFrame.median with numeric_only=None will include datetime64 and datetime64tz columns in a future version.
  ukr_rus_df['national_average'] = ukr_rus_df.mean(axis=1).round(2)
/var/folders/h7/8phf74x52sb11gfklddg5sy40000gn/T/ipykernel_13715/3298357071.py:13: FutureWarning: DataFrame.mean and DataFrame.median with numeric_only=None will include datetime64 and datetime64tz columns in a future version.
  ukr_rus_df['national_median'] = ukr_rus_df.median(axis=1).round(2)

,date,IA,KS,UT,VA,NC,NE,SD,AL,ID,...,SC,IN,LA,DC,MT,AR,WV,TX,national_average,national_median
307,2021-08-31,139300.67,128136.77,414523.52,203577.57,194478.87,204119.28,193458.37,133235.30,336641.07,...,166449.81,170898.27,154240.54,671672.88,381705.37,115524.37,93315.77,174507.74,287770.49,226850.56
308,2021-09-30,140763.50,128926.81,422940.14,205324.97,197349.07,205709.97,195020.26,134684.67,342551.38,...,167430.04,172987.97,155599.62,670978.50,391433.93,116842.67,94142.57,177237.70,291651.16,229407.03
309,2021-10-31,142012.00,129759.92,430549.17,206937.93,200361.73,207407.21,196510.30,135983.44,347384.17,...,170424.82,174978.90,156717.96,672519.00,399603.37,117977.37,94852.43,179590.15,295091.99,231102.57
310,2021-11-30,143104.20,130823.12,438055.07,211097.17,203521.90,209324.14,197749.63,137243.44,350035.79,...,173067.43,176993.17,157671.15,671411.12,405450.67,119110.80,95538.37,181526.85,298123.61,232670.78
311,2021-12-31,144866.80,132530.15,447211.62,209860.63,203632.71,212908.41,200869.93,138015.77,361459.37,...,176332.54,179882.97,159512.62,671481.88,413881.83,121206.67,88497.44,184778.81,301935.17,237106.68

#### The Gulf War

In [115]:
# Import housing prices from Federal Reserve Economic Data csv in Resources folder

df = pd.read_csv("Resources/gulf_war_index.csv")

# Investigate dataframe

df.head()

  observation_date  QUSR628BIS
0       1970-01-01     60.8903
1       1970-04-01     60.3328
2       1970-07-01     60.6021
3       1970-10-01     60.5464
4       1971-01-01     61.7321

In [116]:
# Clean up dataframe

df['observation_date'] = pd.to_datetime(df['observation_date'])
df.rename(columns = {'QUSR628BIS': 'quarterly_housing_prices'}, inplace = True)

# Investigate dataframe

df.head()

  observation_date  quarterly_housing_prices
0       1970-01-01                   60.8903
1       1970-04-01                   60.3328
2       1970-07-01                   60.6021
3       1970-10-01                   60.5464
4       1971-01-01                   61.7321

In [120]:
# Create dataframe for housing prices during the Gulf War

mask1 = df['observation_date'] >= "1990-01-01"
mask2 = df['observation_date'] <= "1991-03-01"
mask = mask1&mask2
gulf_df = df[mask]

# Investigate dataframe

gulf_df

   observation_date  quarterly_housing_prices
80       1990-01-01                   93.8162
81       1990-04-01                   93.1032
82       1990-07-01                   91.2690
83       1990-10-01                   89.3036
84       1991-01-01                   88.1170

#### The War in Iraq

In [122]:
# Create dataframe for housing prices during the War in Iraq

mask1 = df['observation_date'] >= "2003-04-01"
mask2 = df['observation_date'] <= "2012-01-01"
mask = mask1&mask2
iraq_df = df[mask]

# Investigate dataframe

iraq_df

    observation_date  quarterly_housing_prices
133       2003-04-01                  116.1994
134       2003-07-01                  118.9464
135       2003-10-01                  122.7670
136       2004-01-01                  125.8849
137       2004-04-01                  128.9512
138       2004-07-01                  133.0457
139       2004-10-01                  137.0434
140       2005-01-01                  141.7703
141       2005-04-01                  145.5324
142       2005-07-01                  148.7909
143       2005-10-01                  152.1849
144       2006-01-01                  153.6969
145       2006-04-01                  150.7980
146       2006-07-01                  148.9581
147       2006-10-01                  149.7784
148       2007-01-01                  146.5249
149       2007-04-01                  139.9277
150       2007-07-01                  135.5149
151       2007-10-01                  130.1677
152       2008-01-01                  123.5137
153       2008-04-01                  115.4853
154       2008-07-01                  108.9670
155       2008-10-01                  106.4734
156       2009-01-01                  103.9390
157       2009-04-01                  102.7089
158       2009-07-01                  102.4131
159       2009-10-01                  102.5919
160       2010-01-01                  102.1912
161       2010-04-01                  101.0206
162       2010-07-01                   99.0120
163       2010-10-01                   97.7960
164       2011-01-01                   95.7091
165       2011-04-01                   93.7225
166       2011-07-01                   93.7235
167       2011-10-01                   93.9558
168       2012-01-01                   94.2254

### Unemployment Rate Data

#### The Gulf War

In [123]:
# Get unemployment rate data from the Federal Reserve Economic Data API

gulf_unemp_df = quandl.get(["FRED/UNRATE", "FRED/UNEMPLOY"], trim_start = "1990-02-1", trim_end="1990-12-31", collapse = 'monthly')
gulf_unemp_df.columns = ['Gulf_unemploy_rate', 'Gulf_unemploy_level']

# Investigate dataframe

gulf_unemp_df

            Gulf_unemploy_rate  Gulf_unemploy_level
Date
1990-02-28                 5.3               6651.0
1990-03-31                 5.2               6598.0
1990-04-30                 5.4               6797.0
1990-05-31                 5.4               6742.0
1990-06-30                 5.2               6590.0
1990-07-31                 5.5               6922.0
1990-08-31                 5.7               7188.0
1990-09-30                 5.9               7368.0
1990-10-31                 5.9               7459.0
1990-11-30                 6.2               7764.0
1990-12-31                 6.3               7901.0

#### The War in Iraq

In [126]:
# Get unemployment rate data from the Federal Reserve Economic Data API

iraq_unemp_df = quandl.get(["FRED/UNRATE", "FRED/UNEMPLOY"], trim_start = "2003-03-01", trim_end="2011-12-31", collapse = 'monthly')
iraq_unemp_df.columns = ['Iraq_unemploy_rate', 'Iraq_unemploy_level']

# Investigate dataframe

iraq_unemp_df

            Iraq_unemploy_rate  Iraq_unemploy_level
Date
2003-03-31                 5.9               8588.0
2003-04-30                 6.0               8842.0
2003-05-31                 6.1               8957.0
2003-06-30                 6.3               9266.0
2003-07-31                 6.2               9011.0
...                        ...                  ...
2011-08-31                 9.0              13818.0
2011-09-30                 9.0              13948.0
2011-10-31                 8.8              13594.0
2011-11-30                 8.6              13302.0
2011-12-31                 8.5              13093.0

[106 rows x 2 columns]

#### The Russian Invasion of Ukraine

In [127]:
# Get unemployment rate data from the Federal Reserve Economic Data API

rus_unemp_df = quandl.get(["FRED/UNRATE", "FRED/UNEMPLOY"], trim_start = "2021-09-1", trim_end= "2022-06-30", collapse = 'monthly')
rus_unemp_df.columns = ['rus_unemploy_rate', 'rus_unemploy_level']

# Investigate dataframe

rus_unemp_df

            rus_unemploy_rate  rus_unemploy_level
Date
2021-09-30                4.7              7666.0
2021-10-31                4.6              7375.0
2021-11-30                4.2              6802.0
2021-12-31                3.9              6319.0
2022-01-31                4.0              6513.0